<script>
    let k = 0;
    function iknaInfo(){
        k= k+1;
        if(k==1){
            document.getElementById("iknaInfo").style.display="block";
        }
        else{
            k=0;
            document.getElementById("iknaInfo").style.display="none";
        }
    }
</script>

<div class="IKNA">
    <div id="textContainerIkna">
        <h1 id="IknaHeader">Персидская <br></h1>
        <p id="IknaTextUnderHeader"><br><br></p>
        <button class="PressMe" on:click={iknaInfo}>Подробнее</button>
    </div>
    <img class="photo-Ikna" src="images/pers.jpg" alt="Инфокоммуникационные технологии и
нейрокогнитивные архитектуры">
</div>
<div class="iknaInfoHolder">
    <p id="iknaInfo">
        Персы – пожалуй самая популярная порода кошек вот уже многие десятилетия… Это лидеры всех выставок и рейтингов, а также одна из самых известных пород с загадочной историей происхождения. А экзотичная внешность и спокойный нрав этих кошек полюбился многим.
        <br>
        Персидские кошки отличаются миролюбивым и покорным нравом – идеальные питомцы с приятным и спокойным характером. Они редко подают голос, а внимания к себе требуют – настойчиво сидя около хозяина и преданно заглядывая ему в глаза. Персы очень любят, свернувшись клубочком, спать на коленях и мурлыкать с умиротворенным видом. Держать их в доме приятно и удобно.
        <br>
        Особенностью этих милейших животных является факт, что они никогда не обидят ребенка, даже самого назойливого, а будут покорно и терпеливо переносить все игры. Персы очень общительны и легко уживаются с другими животными.
        <br>
        В отличие от других пород, самцы-персы более спокойны и вальяжны, чем самки – они, по сравнению с противоположным полом, показывают независимость и самостоятельность. Особенно, когда становятся мамами – вот тут у кошечки конкурентов просто нет.
        <br>
        Персы с наслаждением могут часами наблюдать за каплей воды из крана или жизнерадостно играть с конфетным фантиком. Эти мирные и забавные создания остаются ласковыми и игривыми всю жизнь, и считаются идеальными домашними питомцами и верными компаньонами.
        <br>
        По одной из версий, персы имеют общие корни с ангорской кошкой, по другой – с диким котом манулом.
        <br>
        Впервые о персидских кошках упомянул в своей книге итальянский путешественник Пьетро делла Валле, сообщив, что в 1620 году увидел в Исфахане (Персия, ныне Иран) кошек, которых охарактеризовал как «поразительную необычную разновидность». Позже эти длинношерстные кошки стали очень модным олицетворением благополучия. Страстными любителями персов были, например, король Людовик XIV, королева Мария-Антуанетта и кардинал Ришелье (который безмерно обожал эту породу).
        <br>
        Если верить одной из теорий, в XVII веке некий астроном Николо де Пьереск привез из Анкары (Турция) во Францию двух пушистых кошек, которых преподнес в дар королю. Очаровательные животные сразу стали любимцами во дворце и получили название «ангорских»… потом они попали в Великобританию, где позже и были переименованы в «персидских».
        <br>
        Примечательно, что поначалу этой породой величали только котов с шерстью голубого окраса – как элитных экземпляров, но со временем такое разделение устарело.
        <br>
        И сегодня трогательная «по-детски насупленная» внешность персов мало кого оставляет равнодушным.

        <br>
        Хотите узнать больше? - <a href="https://cattish.ru/breed/persian/">Смотрите здесь!</a> <br>
    </p>
</div>
<style>
    .IKNA{
        background-color: white;
        display: -webkit-flex;
        display: -ms-flex;
        display: flex;
        align-items: center;
        max-width: 80%;
        margin-left: 10%;
    }
    .photo-Ikna{
        margin-left: auto;
        margin-right: 5px;
        margin-bottom: 5px;
        margin-top: 5px;
        border-radius: 10px;
        height: auto;
        width: 100%;
        max-width: 180px;
    }
    #IknaHeader{
        font-size: 3vw;
        font-family: Gilroy;
        margin-bottom: auto;
        margin-left: 5px;
    }
    #IknaTextUnderHeader{
        font-size: 2.5vw;
        display: block;
        margin-left: 5px;
    }
    #textContainerIkna{
        display: block;
        margin-left: 10px;
    }
    .PressMe{
        margin-left: 7px;
        max-width: 100%;
        background-color: rgba(0,217,255,0.58);
        color: black;
        border-radius: 5px;
        font-size: 3vw;
        text-shadow: #333333;
    }
    .iknaInfoHolder{
        display: flex;
        max-width: 100%;
    }
    #iknaInfo{
        display: none;
        margin:10px;
        font-size: 3.5vw;
        word-break: break-all;
    }
</style>