<script>
    let k = 0;
    function viewInfo(){
        k= k+1;
        if(k==1){
            document.getElementById("bisInfo").style.display="block";
        }
        else{
            k=0;
            document.getElementById("bisInfo").style.display="none";
        }
    }
</script>

<div class="bis">
    <div id="textContainerBis">
        <h1 id="bisHeader">Сибирская <br> кошка</h1>
        <p id="bisTextUnderHeader"><br><br></p>
        <button class="PressMe" on:click={viewInfo}>Подробнее</button>
    </div>
    <img class="photo-bis" src="images/sib.jpg" alt="Сибирская кошка">
</div>
<div class="bisInfoHolder">
    <p id="bisInfo">
        Сибирские кошки считаются настоящими русскими красавицами. Их выразительные глаза, шикарная шелковистая «шубка» и дружелюбный характер – давно завоевали сердца многих любителей кошек.
        <br>
        Сибирские кошки обладают сильным характером, что не мешает им быть очень ласковыми со своими хозяевами. Они абсолютно лишены агрессии, отличаясь завидным терпением. Детей они обожают и с удовольствием с ними играют. Прекрасно контактируют с другими животными в доме и настороженно относятся к незнакомым людям, но и к ним быстро привыкают.

        «Сибиряки» – деликатные и сдержанные животные, они не станут ходить за хозяином по пятам и выпрашивать ласку. Но если почувствуют, что в них нуждаются, тут же возникнут из «ниоткуда» и постараются сделать всё, чтобы поднять вам настроение.

        Эта порода обладает отличными охотничьими инстинктами, благодаря чему могут выжить в любых условиях. Они практически лишены чувства страха, не боятся даже собак, а свой дом охраняют как заядлые собственники.

        Очень умные, у них прекрасная память, и где туалет – они понимают сразу. Быстро запоминают свое имя и мало «болтают» (разве что иногда напоминают о себе мяуканьем, когда, например, вы забыли положить в миску еды).

        Очень любят находиться рядом со своим хозяином, но если его долго нет – могут побыть и в одиночестве. Они невероятно преданные, хотя не очень-то любят это демонстрировать.

        <br>
        Как уже понятно из названия, родина этих кошек – Сибирь. По сути, их жизненный путь напоминает историю Золушки – от деревенских «жителей» до пьедесталов всех мировых выставок. Что примечательно: «сибиряки» – это не плод скрещивания других пород, они появились естественным путем (т.е. это аборигены, а не результат действий фелинологов)… Но и здесь не обошлось без легенд. Если верить одной из них, то сибирские кошки попали к нам из Европы, и якобы в них течет кровь персидских представителей кошачьих. А по другой версии – эта сибирская порода появилась путем скрещивания домашней и дикой кошек.
        <br>
        Первые упоминания об этой породе (как о «бухарских») встречаются в изданиях XVI века, а «официальная карьера» сибирских кошек началась 1987 году – когда стандарт породы представил кот Роман, который на выставке в Германии получил наивысшие баллы… Затем, в 1992 году, кот Димка завоевал звание чемпиона WCF, а в 1997 году породу признали организации FIF и TICA. В 2006 году сибирская кошка Феня стала чемпионом Европы и Мира CFA в США, завоевав титул DSM (почетный победитель выставок), где её назвали лучшей породой. С тех пор сибирская кошка получила известность во всем мире и покорила сердца многих людей.


        Хотите узнать больше? - <a href="https://cattish.ru/breed/siberian-cat/">Смотрите здесь!</a> <br>
    </p>
</div>
<style>
.bis{
    background-color: white;
    display: -webkit-flex;
    display: -ms-flex;
    display: flex;
    align-items: center;
    max-width: 80%;
    margin-left: 10%;
}
.photo-bis{
    margin-left: auto;
    margin-right: 5px;
    margin-bottom: 5px;
    margin-top: 5px;
    border-radius: 10px;
    height: auto;
    width: 100%;
    max-width: 180px;
}
#bisHeader{
    font-size: 3vw;
    font-family: Gilroy;
    margin-bottom: auto;
    margin-left: 5px;
}
#bisTextUnderHeader{
    font-size: 2.5vw;
    display: block;
    margin-left: 5px;
}
#textContainerBis{
    display: block;
    margin-left: 10px;
}
.PressMe{
    margin-left: 7px;
    max-width: 100%;
    background-color: rgba(0,217,255,0.58);
    color: black;
    border-radius: 5px;
    font-size: 3vw;
    text-shadow: #333333;
}
.bisInfoHolder{
    display: flex;
    max-width: 100%;
}
#bisInfo{
    display: none;
    margin:10px;
    font-size: 3.5vw;
    word-break: break-all;
}
</style>